inference/inference-LEONARDO/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_4-GPUs_16-TP_4-PP_1-MaxModelLength_8192/launch-1/logs_benchmarking_1000-concurrency.log
INFO 04-02 10:06:52 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_work/MNRVA_bench/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=1000, model='/leonardo_work/MNRVA_bench/models/Mistral-7B-Instruct-v0.3', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_work/MNRVA_bench/minerva-benchmarks/inference/inference-LEONARDO/results/vllm/sharegpt/Mistral-7B-Instruct-v0.3/Nodes_4-GPUs_16-TP_4-PP_1-MaxModelLength_8192/launch-1/Concurrency_1000.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1000
============ Serving Benchmark Result ============
Successful requests:                     878       
Benchmark duration (s):                  29.06     
Total input tokens:                      179340    
Total generated tokens:                  202500    
Request throughput (req/s):              30.21     
Output token throughput (tok/s):         6967.25   
Total Token throughput (tok/s):          13137.66  
---------------Time to First Token----------------
Mean TTFT (ms):                          5892.39   
Median TTFT (ms):                        4980.61   
P99 TTFT (ms):                           14306.37  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.67     
Median TPOT (ms):                        22.62     
P99 TPOT (ms):                           31.44     
---------------Inter-token Latency----------------
Mean ITL (ms):                           22.47     
Median ITL (ms):                         20.51     
P99 ITL (ms):                            60.60     
==================================================